package lesson_3;

/*
        2. Написать простой класс ТелефонныйСправочник, который хранит в себе список фамилий и телефонных номеров.
         В этот телефонный справочник с помощью метода add() можно добавлять записи. С помощью метода get() искать
         номер телефона по фамилии. Следует учесть, что под одной фамилией может быть несколько телефонов
         (в случае однофамильцев), тогда при запросе такой фамилии должны выводиться все телефоны.
 */
public class Task2 {
    public static void main(String[] args) {

    }
}
